In [42]:
#import pandas

In [55]:
import pandas as pd

In [56]:
# Read in the Admission_Predict.csv at ../../data/Admission_Predict.csv and set the index column 
# to the first column (index at 0)

In [57]:
df = pd.read_csv("../../data/Admission_Predict.csv", index_col=0)

In [58]:
# make your way through all columns, making them all lowercase and stripping all whitespace

In [61]:
df.columns = [i.lower().strip() for i in df.columns]

In [62]:
# Create a mask for the "chance of admit" column. Make it mask values greater than 0.7

In [66]:
admit_mask = df["chance of admit"] > 0.7

In [73]:
# Using the where method 
# Use the new rating mask, lay it on top of our original dataframe and output that

In [68]:
df.where(admit_mask).head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [25]:
# Do the same but this time drop the values with NaN

In [70]:
df.where(admit_mask).dropna().head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
6,330.0,115.0,5.0,4.5,3.0,9.34,1.0,0.90

In [74]:
# Use the shorthand version now to do both the where and dropna of the above

In [89]:
df[df['chance of admit'] > 0.7].head()
# Or df[admit_mask].head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
6,330,115,5,4.5,3.0,9.34,1,0.90

In [90]:
# Use the same [] operator to output a df with only the gre score and toefl score as columns

In [91]:
df[["gre score", "toefl score"]].head()

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [92]:
# Combine boolear operators to output the df dataframe
# where the chance of admit is over 70 percent and the toefl score is over 115

In [97]:
(df['chance of admit'] > 0.7) & (df['toefl score'] > 115)

Serial No.
1       True
2      False
3      False
4      False
5      False
       ...
396    False
397    False
398    False
399    False
400    False
Length: 400, dtype: bool

In [98]:
# What is the second way to do the above, but with lt and gt. Recall the difference
# is the no longer necessity of the parenthesis

In [99]:
df['chance of admit'].gt(0.7) & df['toefl score'].gt(115)

Serial No.
1       True
2      False
3      False
4      False
5      False
       ...
396    False
397    False
398     True
399    False
400     True
Length: 400, dtype: bool